[[{"reviews": ["It not merely out of loyalty that I give this book 5 stars, it really is a worthy read for anyone who has followed him and also very young generation who want to understand why he has a special place in our hearts... Him talking about his favourite series which ironically turns out to be the one where he bowled wonderfully in the last match, and world cup 2003 with the trials and tribulations of nervousness and dehydration and real exhaustion and still finding the strength to carry on... I hoped he would talk about the 98 against Pakistan and he did, and I dont think he realises how inspiring it is to hear his anecdotal reference to the preparation before the next match, for him its probably just an embarrassingly funny story... but as a reader I felt ashamed of how laid-back I am about my passions.", "The chapter on his wife and marriage is kind of the stuff romantic movies are made of, pretty sure some filmmaker will realise it soon.. anyway, it seems I can ramble on about this... in a nutshell, its wonderful book... yeah there is no scandoloud expose about matchfixing, but I knew that even before I read it, cause you know him, Its just not his way ;)", "This is my first review here and I am so glad its for a book he wrote", "Let me make it clear that I consider myself the greatest Sachin fan alive. However I shall try to be fair in my review.", "The first 100 or so pages that described Sachin's childhood formed the best part of the book. You would laugh, smile, get astonished and surprised (\"Sachin used to do this to?\" ...you would think). You will find that Sachin was, in most ways, the same cricket loving kid you were and will be able to relate to many of his mischief,ideas and thoughts.", "However the fun ends along with those chapters. The rest of the book is a like a commentary of his matches. Almost all the matches have been included. It will refresh your memories of Sachin's batting, and you will relive some of the matches you might have forgotten.", "However for a Sachin fan who would have certainly followed most of his career and would have all of his matches strong in his memory, this is provides little comfort. You expect more from Sachin than just summary of his matches.", "Like most of the books on Sachin, this one too misses out on some of his iconic ODI innings. The 200 against SA is just brushed upon in commentary. The 175 VS Australia is not even mentioned. Focus is more on tests and less on ODIs.", "I bought an edition with some great personal photographs of Sachin.", "The book also does provide some dressing room gossips that Indian general fan always looks forward to, but in just the subtle amount. Strong views on Chappel, the 194 declaration by Dravid, some of his ideals and some surprising cricketers Sachin respects... all of these provide little  treats to the reader.", "While some might skim through pages, this book provides some great insight  as to how Sachin used to prepare against some bowlers. How he used to adjust during difficult times. What strategies he used to form. At times I felt, how come Sachin has just hundred 100s, he should be having about 200 centuries. And this might just be the material a teenager, wanting to make a career in cricket might find extremely useful.", "There is humor in appropriate amount. And almost all varities of statistics possible. Whole scorecards have been included.", "This would be an ideal book to gift to your son/sibling if he is thinking of a future in cricket as his career.", "I give it 3.5 stars.", "Being a vivid Sachin fan I expected more of thought process and behind the screens happenings in the game and in the dressing room. But this book is disappointment on this front. This book is more of various essays about all his innings put together.", "Even after reading the book you wont get a feeling that you know Sachin more than before reading it.", "There's nothing in it which we don't know. Rather than describing his hardships and mental make-up for the game, the book just feels like a scorecard and summary of every series he played. If you are not a cricket fan, you should stay away from this and if you are one, then too you will be disappointed with this.", "The book as such reads like a Journal - mostly a running commentary of matches (although important, key matches) which gets monotonous after a while. That is something, since all the matches mentioned are the milestone matches in Sachin's career and for any fan of Indian cricket, that holds considerable interest.", "Sachin's relations within his family, especially with his kids, with teammates, and the food he had during his tours, besides personal anecdotes from some of the matches are broadly the highlights of the book. Also,finer points of his playing technique are mentioned here and there, which would be of interest to the keen follower of the game.", "The part of the book that lets you down is its non-controversial stand on most issues. Match fixing is mentioned only in passing, barely a few pages are dedicated to the Monkeygate scandal. BCCI is held up in high esteem almost everywhere. Most surprisingly, Yuvraj Singh's struggle with cancer and Sachin's stint with the Parliament as a Rajya Sabha member do not find a mention in this book.", "It is still worth buying and reading, because it is Sachin after all. The pictures generously sprinkled within the book are a collector's delight. What strikes one throughout the book is the straightforward, uncomplicated approach that Sachin seems to have towards his life. That alongwith the devotion towards family, the patriotism and the attention to the minutest details of the sport are the key impressions one could treasure, as we complete this book.", "When you follow a sports personality and the game passionately for so long, you'd expect the life story to be equally riveting. This books while good and informative falls short of being great. It seems rather superficial and gives you nothing but a bit more than what is already known about the man. It doesn't help that there are pages and pages of statistics which seem to be there for the sole purpose of filling up pages.", "It would've been nice to have some personal views from the man on things like the match fixing scandal and his views of Azharuddin and Jadeja getting caught in the storm, his relationship with Vinod Kambli or even more anectodes if being on tour. Maybe, like with his batting we come to expect too much from him...", "In last 20 odd years, I loved reading anything written on Sachin and was hoping for great insight about this man. Honestly, it was bit disappointing except for first few chapters and last few chapters. I felt like some of the contents were rushed through in hurry. Though I'm not dissapointed by Sachin himself, but certainly Author has done poor job in extracting best out of Sachin and articulating in rather insightful way. Perhaps, it would have been good idea to write multiple volumes rather than rushing through all in one shot. No matter what, my admiration for Sachin will be same forever.", "Even if Sachin scores reasonable runs but fail to reach 100 then most of us feel as if Sachin failed. That's his stature - we always demand the best of him. So it is obvious that we all must be having Everest high expectations from his book as well.", " Motivation, doubtless dedication, childish fun, a bit of romance, writhing in stress of expectations, bouncing back - this book tells it all. Hands off to the legend for giving very minute details of life even if sometime it is embarrassing and sometime controversial.", " But for some reasons to a great section of book lover it is not going to be a great book. Just like 90+ out score this book does not reciprocate to the highest level of expectations.", "My analysis goes like:", "-> For those who aim to play for state/country this book is a MUST read.", "-> For many cricket lovers who are not interested in technicality of the game  - a few chapters MUST be SKIPPED", "-> For those who have no extra warmth for cricket - only a few chapters can be read", "Finished reading the book \" Playing It My Way\" an autobiography of Sachin Tendulkar. For those in search of any sensational revelations in the book, it is a a disappointment. Nobody expects from a person who has steered clear of any controversy during his playing days, to create any sort of controversy at this stage. Though a major portion of the book just appears as statement of facts, hence repetition of what is already universally known , the author should not be blamed for that because the events surrounding Tendulkar ,on and off the field, have unfolded before us in the last 25 years or so. In the narrative, there are many instances of mind games played and strategies adopted to outwit the opposition which makes up for very interesting reading. A disappointing aspect in the book, however is that the author has not devoted much space to some of his great contemporaries. No mention is made about Kapil Dev's final appearance in test cricket though Sachin was a member of the team at that time. More surprisingly, some of the gem of innings played by Rahul Dravid hardly gets mentioned.Though Rahul and Sachin partnered in Test maches in 143 innings, and scored 6905 runs as partners with 20 century and 29 half century partnerships,it is surprising that Rahul's achievements and his contribution to Indian cricket has not found any place in the book. In this respect, Brian Lara, Sourav Ganguly and V.V.S.Laxman should consider themselves slightly better off.", "To sum up, much more was expected from Sachin Tendulkar,not only about himself, but also for his insights about those greats who played along with him and against him.", "finished it ....sachin is the best....we saw ....funny ....naughty....normal....emotional....family guy....sachin's journey through his eyes...", ".how he achieved the greatness.....but remain gentle....kind....always on the ground...only his bat talked....countless pains ....sacrifices...sheer hard work......passion....compassion......the man we all loved....lived his dream with our dream.....the tears on his failure...the joy n celebration on every little success ,he had we all had....our world stopped whenever he played....nothing else mattered ....his nervous nineties made us nervous....his 100s made us forget personal failures...a 16 year boy ....Indian conquered the world......we all did....honesty...kindness...politeness.....hard work....optimism...are his virtue...simplicity at its true beauty...an artist... true bharat ratna....world ambassador.....you will always be in our heart....will watch your innings again and again and again....we love u....thank u sachin"]},
{"reviews": ["WE LOVE YOU SACHIN......", "WONDERFUL BOOK.....", "EVERY TIME WE TURN ON THE TV TO WATCH A CRICKET MATCH WE ALL WISH THAT ITS YOU WHO IS COMING TO BAT WITH THAT ADIDAS BAT AND ENTERTAIN US ALL......MISS U", " Dear viewers if you read this book it is going to be a lifetime experience", "Never expected something humorous from a sports legend. Credits to Boria Majmudar for narrating it in a way that excites a common man. It gives access to Sachin's personal life which he always given shield and privacy. Even if you are not a vivid reader of books, it will be easy to go on.", "Though am a die hard fan of sachin, but his autobiography left me quite disappointed. It failed to provide the insights into cricket and his personal life that a reader would look forward to. Most of it contained the information that a person who follows Sachin and cricket already knows.", "Is there any necessity to write anything on this book? It's a treasure. Price is reasonable but what about for those who can't afford to buy it. I happened to visit my native village and donated the book to the village library. The youngsters treated this book just as a Holy Book.", "Honestly, i didnt thought it would make me curious, smile, laugh and emotional while reading it. But this book has got all the ingredients. There are many short stories about his confrontrations with opponents which would held you on your seats and will make you owe later.", "Well drafted autobiography. ST could have discussed more about the present/future crop of players. Surprised not much has been mentioned about Dhoni, one of our most successful captians in all forms of Cricket. Book packaging and delivery very well handled by Amazon.", "The life story of a Superhuman. Has been my idol since childhood. But still there were certain lovely secrets, of which we all knew nothing. The potrayal of a life so special... which inspired billions. Bharat Ratna Sachin Tendulkar. A must read for one and all.", "A book which is riding on the popularity of the name! And, of course, on the press hype. Little in substance.", "I gifted the book to my boyfriend who is a huge fan of Sachin Tendulkar. I remember how emotional he got listening to Sachin's farewell speech. He loved this gift from me. Excellent gift for Sachin fan :) I am yet to read the book. Waiting for him to finish.", "Great book. But again, Sachin has kept it very very professional with not many juicy bits. But indeed great to know in detail on how much Sachin struggled everyday to be the master he is. One time read but definitely a collector's treasure."]},
{"reviews": ["I just loved it..he has won our hearts with his awesome performances throughout his career..and he is still doing the same thing even after his retirement..", "Autobiographies by Indian players are very rare - we have had only one in the last twenty five years from Kapil Dev - so i  was expecting this to be a magnum opus - but it falls well short of expectation - only the sheer size and the brand name carries it through", "This come out as more of a statistics and complete coverage of all the series Sachin has played and his dismissals- as ghosted by Boria M.But most of the autobiographies don't cover each and every series - usually the more prominent series are given more coverage.", "There are some insights on his personal life , relationship with Anjali , his music likes etc and some thoughts on his personal battles and preparation for some key matches like Pakistan in 2003 and the Multan 2004 declaration- however what is missing is his thoughts on who were the best players he played against - who were the most difficult bowlers he  played against (apart from Cronje) - what would be his World XI  and of course some insights on the match fixing controversy.i would have wished this book to have focused more on Sachin's observations on techniques , some thoughts on his Indian team mates - what was his best Indian team etc and to be less obsessed with facts and figures.", "I would refer to Ricky Ponting's book which had a lot of interesting snippets in boxes which would have embellished this long awaited book by Sachin.", "after reading the 500 page book, my first feeling was 'sachin has written so little'. A sachin fan would have liked to know much more about sachin and his views on some critical topics. however reading the book is like revisiting the magic that sachin created all these years. it is a must read for all his fans. i am waiting for another book from the master himself, which will cover the portions left in this book. boria majumdar could have certainly done better in his narration. well,", "This is more like an elaborate Wikipedia article on Sachin Tendulkar - neither a nuanced autobiography nor a great cricket book. There are even a number of proof-reading errors. Looks like a hastily prepared book. I am a Tendulkar fan. So no problem in keeping it as a memorabilia. Non-fans and those looking for serious cricket books or autobiographies may well leave this wide outswinger of a book. He has mastered the art of batting, but not the art of writing or story telling.", "I bought it for my husband who is a diehard Sachin fan...he not only follows his cricketing style but also adores him as the man himself off the field, his ideologies.I thought this book will have enough of the later one so pre-booked and gifted him...But While I started reading it I could just find that other than few small stories here and there Sachin has not really opened up himself  in this book to every situation;he has not stated how he thought,what was his reaction,thought process etc...It is true that he is such a talked about figure that nothing was unknown about him but wanted to see all these hard work,success,humility,honesty from his perspective....I felt that this book lacks that..other than few unknown stories (Anjali chapter, may be a little of Greg Chappel story(this hardly would be 10 liners)) it seemed to me like a match report summary of his entire carrier...Sachin fans please excuse me..but I stand by what I said... Thanks!!", "Tendulkar’s autobiography is similar to his hundredth and last international hundred – a laboured, mechanical, unspectacular effort against a weak opposition that was perhaps not worth the long wait or the momentousness of the occasion. Like that innings, it achieved a much coveted statistical milestone amid much fanfare but served little other practical purpose and had only momentary glimpses of the genius that the little master is known to be capable of.", "This was a plain cricket commentary with scores and stats and the read was as uninteresting as some of the domestic cricket matches shown in Doordarshan. The language, flow, flair of the book was just ordinary. Thoroughly missed Sachin's analysis on a) what made him the master that he is b) the turnaround of Indian cricket c) his analysis of the different controversies that surrounded Indian cricket.", "Some of the photographs printed are real treasures.", "Very disappointed with this book....waited months for its release but after reading it i felt why it was written. Growing up in India and being a sachin fan i followed him and every news related to him since 1996 world cup, and knew most of the things abt Master (thanks to the media) and it was really sad to find same things written in the autobiography. As mentioned by other reviewers we were expecting something which was not all known to the world.", "Didn't like too much as book neither gives motivation nor inspiration. Book could be more interesting if publishers had removed the unnecessary statistical data.", "\"Some are born-great, some achieve greatness.....some have greatness thrust upon'em!\", Shakespeare says those words and distinguishes greatness in three terms but if he did get the pleasure of watching Sachin Tendulkar, batting on twenty-two yards, I bet my assurance on his will to reword those lines into.....Whatever a great does but hardly flourishes the word 'great' as few have ever done and Sachin stays with them."]},
{"reviews": ["I go through the book, we respect the achivement of sachin tendulkar, but not his book, its not containing what we expected. it is like a redaing of his match innings,  90% of episode we knowing earlier. only good thing is i got the copy with lower price by amazon.in", "thanking you", "with regards", "somashekar padukare", "bangalore", "I think it's a very simple narration of key events of his life that made him the person he is. I liked it. There were many things we get to know about Sachin's professional as well as personal life.", "If expecting an immensely motivational or dramatically controversial, this is not the book. It's simple and honest just like Sachin himself.", "The book is well written and the enthusiam of Tendulkar is well captured... However could have been better if he himself wrote it. Many times it feels very unlike Tendulkar. Also Tendulkar is made to guiltless in the entire book and all his bad performances are made out to be due to circumstances and luck, which is something untrue.", "Must have for all Sachin fans. Official one from the Little Master Himself.", "Very simple and easy to read language. I personally found his schooling years, the struggles and the Shardhashram days most interesting and it will bring a smile to anyone.", "Many photographs, stats etc.", "Overall a good read", "Autobiography :  is a written account of the life of a person written by that person.", "There are good things and bad things. This book has become more fiction like rather an autobiography. There are only good things that he talks about and has remained netural all the other things that happened.", "Read Sachin's autobiography written by Boria Majumdar in about 3 sitting. The first thought on completing the book was how conveniently some topics were removed or just touched briefly to avoid any controversy and how great the book was marketed so that each and everybody should go and read it. Sachin has systematically taken us ( the reader ) step by step from the childhood to retirement. The childhood memories were the best part of the book as it revealed somethings that many of us did not know. Also his great admiration and love for his family is well portrayed and stands in good light for those who follow Sachin - the Bharat Ratna.", "  Overall the book is all about his journey in terms of how many runs he has scored in a match, how he tacked the best of the bowlers, how unlucky he was because of some umpire decisions went against him ( which could have been omitted a few times ) , what he ate after the matches. The book essentially lacks the insights, the dramas, the thought process, and his opinions on others. The book is all about 'my runs', 'my shots', 'my team' and 'my country'. We all love Sachin for what he has done for India and in true sense is a Bharat Ratna. Throughout a carrier of about 20+ years he has shown maturity, dignity and has been humble in all possible conditions he has been put too. But the book definitely lacks a punch; it is rather a a scorecard rather than personal journal.", "A very descriptive autobiography by a very simple and humble man whom we all love and pray for..one who made every Indian forget their own problems for a moment at least .. a stop to whole nation..winning so many hurdles in life and on field..", "Sachin is a immortal man and a hardworking caring person. India is his pride and honour. Cricket was his life for 21 years. Knows everything and is known by everyone related to cricket in any form", "Sachin Tendulkar is a phenom that has made all sports grow better in India as well as many sports persons. He has filled in dreams  for the next generation through his own examples. He is just putting these and many unknown things about his life for everyone to be inspired to live and work for India as a true humble person.", "Very poor writing (almost high school standards), and hardly any personal insights. The book reads like a paraphrasing of scorecards from the past. A safe and rather bland offering from which, I would strongly recommend, any bibliophile stay miles away.", "Thanks Amazon for prompt service. Bought it for gifting a sachin fan. He was totally disappointed with it, and told \"Better watch his innings\". This autobiography is not up to expectations. Maybe a fan could write a far better biography for him.", "It was an OK book. I was expecting an insight into his life whereas the book takes the reader to various incidents/ experiences and leaves it to the reader to form his opinion . Of course , very readable and simply presented"]},
{"reviews": ["Well,this is Sachin's autobiography after all,so don't want to subject it to too much criticism,but overall kind of disappointing. He doesn't open up a lot about controversial things and is politically correct almost all the time. For someone who has played for over 20 years, you expect more from an autobiography. The book is almost like a summary of every tour he has gone on. Interesting tidbits about Anjali,his family etc.", "I am on the verge of completing this book. Have been reading at a leisure pace for the last one month.", "Nice packaging, Not so heavy, Paper quality was optimum, Pleasing to read because of large fonted text, rich colored photographs.. More than all that, It's a genuine product and genuine story of a genuine India's great.", "Shouldn't think much when Amazon is offering at quite an affordable price.", "This book has nothing new to offer, for Sachin's career and personal life have already been well documented. The book is too lengthy and the narration and writing style have left much to be disired.", "An Overhyped book. Was hoping to finish the book soon. Few sentences are really worth reading. But not a good buy.", "Haven't really expected much from this book. So much has already been written about Sachin.", "I was rather expecting some rare and special photographs. But it was a disappointment. All the photographs are well seen.", "Only one was special..the piece of paper Sachin used to write the names in his farewell speech!! This book has a nice photograph of that. :)", "This is complete waste of time. I stopped reading it after 200 pages. It's like statsguru of cricinfo in a book filtered by Sachin. I expected so much more, I wanted to read his emotions, what he went through at the time of crisis like match fixing etc but nothing. I have seen sachin play from him first match and this book was like replay. Not recommended.", "Well i am a huge sachin fan. But this book is not what i expected. Apart from some unknown incidents it doesnt provide much into tge life of God of Cricket. At the end i realised it was just a stats book. Not an autobiography.", "And Amazon's service is way better then other online retailers. And that was the only thing i liked about the order.", "The book is very descriptive. Maybe some people find it as less literature but it has all the description to how to be prepare as a sportsman more so over how to be a great human being. Sachin Tendulkar, The God as we know, din't hide when he sometime did behave wrongly. Every coach/parents read this book to prepare their children for the future.", "Most of what is written in the book is about matches and scores that has already been printed. Was expecting to know more of his inner struggles and inner dialogues of the champion. They should have contrubuted equally to his outer struggles. Was very much disappointed to see only a small para describing the first obe day double century.", "An excellent account of Sachin's cricketing career and that of what Indian cricket was in those 24+ years with some glimpses of Sachin's personal and family life. This is the best gift of 2014 for many cricket lovers all over the world and most certainly for me. Thanks Amazon for allowing me to receive it in a such an easy way."]},
{"reviews": ["I am an ardent fan of Tendulkar and all through his cricketing years i used to be a vocal supporter and die-hard fan. In fact I have stopped watching cricket when he has retired. Now cricket is boring thing for me. I have bought this book with great expectations and I must say I am deeply disappointed. I cannot digest Sachin finding fault with Dravid for declaring the innings in Multan, Pakistan because he cannot get his double hundred. When I bought the book I did not expect it to be mystery thriller or page turner. But this book is a real bore. Only snippets here and there were interesting. Only the high regard for Sachin made me to buy this book.", "Finished going through every pages of my Holy Book Playing it My Way the Autobiography of my God. The respect, Love, Devotion i had for him is just multiplied by infinite. Thoroughly enjoyed every bit of reading for the first time ever in my life, it took only 2 day's and night for me to complete the book of nearly 480 pages.", "Top three phases of book I liked is:", "1. When Sachin woke up in a middle of his surgery in April 2003. Went under knife on his left hand ring finger due to a calcification, he was so worried surgery will be made on his palm and the will force him to change the way he grips the bat.", "‪#‎OnHisOwnWords‬ : I was so obsessed with this issue", "that I woke up during the surgery and asked them to show me where they had made the incision. Dr", "Joshi later told me that they were all surprised to see me awake despite the anaesthesia. The doctors", "showed me that my palm had been left untouched and told me to calm down and allow them to carry", "on. Satisfied, I instantly drifted back to sleep.", "2. When he had tummy upset on the eve of a match against Srilankan's.", "#OnHisOwnWords : Here I am a bit embarrassed to reveal a very personal secret", "relating to the Sri Lanka match. On the eve of the match I had a bad stomach and was feeling", "dehydrated. This happened because I had not yet fully recovered from the cramp I had suffered while", "playing Pakistan and as a result had had a lot of isotonic drinks. I also added a teaspoon of salt to the", "energy drinks, thinking it would help the recovery, and that caused a tummy upset. In fact, the situation", "was so bad that I had to bat with tissues inside my underwear. I even had to go back to the dressing", "room during one of the drinks breaks and was feeling extremely uncomfortable in the middle. I", "somehow scored 97.", "3. On last day of his career, after the final speech where Kholi came to meet Sachin and the gesture he did when Kholi touched his feet.", "#OnHisOwnWords : As I was sitting by myself back in the dressing room, Virat walked up to me again. I could see tears in", "his eyes. He held out his hands and said his dad had given him these threads, the kind that Indians", "wear around their wrists for good luck, and he had always wondered who he would give them to. It", "had to be someone very special. Then he handed them to me before touching my feet as my younger", "brother. I was speechless. I held him tight and said, ‘Arre tu yeh kya kar raha hain? Tujhe yahan", "nahi, yahan hona chahiye.’ (What are you doing touching my feet? You should be giving me a hug.) I", "couldn’t say another word because I felt choked with emotion. A lump had formed in my throat and", "finally I had to ask Virat to leave, knowing I would burst into tears if I tried to say anything else. It", "was a gesture I can never forget and I wished Virat all the success in his career.", "* This Showed his love towards the sport, his never give up attitude and humility even after reaching the farthest peak.", "* All those cries in the Bathroom were just wonderful to know the Legend who conquered the world has a kid inside him.", "Love you Sachin Tendulkar on the whole the eagerness to touch your feet just went to its peak. Proud to a ‪#‎Sachin_Devotee‬", "It's like reading a news paper", "Lacked critical insights and was very politically correct", "Not expectedly, even baru wrote better", "Tendulkar should have revealed everything. Because people adore him as an idol, that's why he should have covered everything of his life. After all autobiography is everything about the self.", "It is simple recording of his life. He never explains the reasons for following a particular action. I am surprised Mr. Boria did not guide him. At best an average account of Sachin's life.", "A Wonderful cricket journey of a legend has been beautifully put together. It's a pleasure to read about THE Sachin Tendulkar's experiences both on and off field and his way of dealing life and cricket. It's moving to see how down-to-earth the man still is, having achieved 'Bharat Ratna' the greatest honour in India.", "A minor dislike would be: there were a lot of statistics details throughout the chapters which could have been covered at the appendix, but overall some of the moments were so touching that they literally gave you tears.", "I just love the way Sachin played his game, and more importantly his personality. I was desperately waiting to get this book. But I am very disappointed with this book. Picture quality is very high so the book is costly. It is just a recap of the many series he played put together. There is nothing new- we know the stuff he has written in the book. But those who are die hard Sachin fans can purchase the book as I did for a quick summary about his career. Was expecting much more! But my love for him will not decrease.", "It was an honour to read the story of Sachin Tendulkar...i was pretty excited when i started reading the book...", "The book is overall good...but it feels like going through all the matches that tendulkar has played in his lifetime..", "Its not waste of money...coz even a big sachin fan can miss out few things about sachin...while the book has lot of it...but the book doesn't actually inspires one..it gives the insight of sachin's life...", "Still being a sachin fan i would always say....i loved the book...", "as a sachin fan 95 % of the things written are know .", "This book as an auto biography is very  much  contrary  to  what  we think  about  Sachin. We know him  as a very humble  cricketer. But, after  reading  this  book, this  notion  is  blown  away. It  is  fully  about I, me and myself. It  is  very  difficult  to  digest  this  nature  of  Sachin.", "In fact I am disappointed  and  disillusioned  to know  the  real Sachin.", "From  now  on  I feel he was  a  great  cricketer. But  not  a great  team  player. Not  at  all."]},
{"reviews": ["It not merely out of loyalty that I give this book 5 stars, it really is a worthy read for anyone who has followed him and also very young generation who want to understand why he has a special place in our hearts... Him talking about his favourite series which ironically turns out to be the one where he bowled wonderfully in the last match, and world cup 2003 with the trials and tribulations of nervousness and dehydration and real exhaustion and still finding the strength to carry on... I hoped he would talk about the 98 against Pakistan and he did, and I dont think he realises how inspiring it is to hear his anecdotal reference to the preparation before the next match, for him its probably just an embarrassingly funny story... but as a reader I felt ashamed of how laid-back I am about my passions.", "The chapter on his wife and marriage is kind of the stuff romantic movies are made of, pretty sure some filmmaker will realise it soon.. anyway, it seems I can ramble on about this... in a nutshell, its wonderful book... yeah there is no scandoloud expose about matchfixing, but I knew that even before I read it, cause you know him, Its just not his way ;)", "This is my first review here and I am so glad its for a book he wrote", "Let me make it clear that I consider myself the greatest Sachin fan alive. However I shall try to be fair in my review.", "The first 100 or so pages that described Sachin's childhood formed the best part of the book. You would laugh, smile, get astonished and surprised (\"Sachin used to do this to?\" ...you would think). You will find that Sachin was, in most ways, the same cricket loving kid you were and will be able to relate to many of his mischief,ideas and thoughts.", "However the fun ends along with those chapters. The rest of the book is a like a commentary of his matches. Almost all the matches have been included. It will refresh your memories of Sachin's batting, and you will relive some of the matches you might have forgotten.", "However for a Sachin fan who would have certainly followed most of his career and would have all of his matches strong in his memory, this is provides little comfort. You expect more from Sachin than just summary of his matches.", "Like most of the books on Sachin, this one too misses out on some of his iconic ODI innings. The 200 against SA is just brushed upon in commentary. The 175 VS Australia is not even mentioned. Focus is more on tests and less on ODIs.", "I bought an edition with some great personal photographs of Sachin.", "The book also does provide some dressing room gossips that Indian general fan always looks forward to, but in just the subtle amount. Strong views on Chappel, the 194 declaration by Dravid, some of his ideals and some surprising cricketers Sachin respects... all of these provide little  treats to the reader.", "While some might skim through pages, this book provides some great insight  as to how Sachin used to prepare against some bowlers. How he used to adjust during difficult times. What strategies he used to form. At times I felt, how come Sachin has just hundred 100s, he should be having about 200 centuries. And this might just be the material a teenager, wanting to make a career in cricket might find extremely useful.", "There is humor in appropriate amount. And almost all varities of statistics possible. Whole scorecards have been included.", "This would be an ideal book to gift to your son/sibling if he is thinking of a future in cricket as his career.", "I give it 3.5 stars.", "Being a vivid Sachin fan I expected more of thought process and behind the screens happenings in the game and in the dressing room. But this book is disappointment on this front. This book is more of various essays about all his innings put together.", "Even after reading the book you wont get a feeling that you know Sachin more than before reading it.", "There's nothing in it which we don't know. Rather than describing his hardships and mental make-up for the game, the book just feels like a scorecard and summary of every series he played. If you are not a cricket fan, you should stay away from this and if you are one, then too you will be disappointed with this.", "The book as such reads like a Journal - mostly a running commentary of matches (although important, key matches) which gets monotonous after a while. That is something, since all the matches mentioned are the milestone matches in Sachin's career and for any fan of Indian cricket, that holds considerable interest.", "Sachin's relations within his family, especially with his kids, with teammates, and the food he had during his tours, besides personal anecdotes from some of the matches are broadly the highlights of the book. Also,finer points of his playing technique are mentioned here and there, which would be of interest to the keen follower of the game.", "The part of the book that lets you down is its non-controversial stand on most issues. Match fixing is mentioned only in passing, barely a few pages are dedicated to the Monkeygate scandal. BCCI is held up in high esteem almost everywhere. Most surprisingly, Yuvraj Singh's struggle with cancer and Sachin's stint with the Parliament as a Rajya Sabha member do not find a mention in this book.", "It is still worth buying and reading, because it is Sachin after all. The pictures generously sprinkled within the book are a collector's delight. What strikes one throughout the book is the straightforward, uncomplicated approach that Sachin seems to have towards his life. That alongwith the devotion towards family, the patriotism and the attention to the minutest details of the sport are the key impressions one could treasure, as we complete this book.", "When you follow a sports personality and the game passionately for so long, you'd expect the life story to be equally riveting. This books while good and informative falls short of being great. It seems rather superficial and gives you nothing but a bit more than what is already known about the man. It doesn't help that there are pages and pages of statistics which seem to be there for the sole purpose of filling up pages.", "It would've been nice to have some personal views from the man on things like the match fixing scandal and his views of Azharuddin and Jadeja getting caught in the storm, his relationship with Vinod Kambli or even more anectodes if being on tour. Maybe, like with his batting we come to expect too much from him...", "In last 20 odd years, I loved reading anything written on Sachin and was hoping for great insight about this man. Honestly, it was bit disappointing except for first few chapters and last few chapters. I felt like some of the contents were rushed through in hurry. Though I'm not dissapointed by Sachin himself, but certainly Author has done poor job in extracting best out of Sachin and articulating in rather insightful way. Perhaps, it would have been good idea to write multiple volumes rather than rushing through all in one shot. No matter what, my admiration for Sachin will be same forever.", "Even if Sachin scores reasonable runs but fail to reach 100 then most of us feel as if Sachin failed. That's his stature - we always demand the best of him. So it is obvious that we all must be having Everest high expectations from his book as well.", " Motivation, doubtless dedication, childish fun, a bit of romance, writhing in stress of expectations, bouncing back - this book tells it all. Hands off to the legend for giving very minute details of life even if sometime it is embarrassing and sometime controversial.", " But for some reasons to a great section of book lover it is not going to be a great book. Just like 90+ out score this book does not reciprocate to the highest level of expectations.", "My analysis goes like:", "-> For those who aim to play for state/country this book is a MUST read.", "-> For many cricket lovers who are not interested in technicality of the game  - a few chapters MUST be SKIPPED", "-> For those who have no extra warmth for cricket - only a few chapters can be read", "Finished reading the book \" Playing It My Way\" an autobiography of Sachin Tendulkar. For those in search of any sensational revelations in the book, it is a a disappointment. Nobody expects from a person who has steered clear of any controversy during his playing days, to create any sort of controversy at this stage. Though a major portion of the book just appears as statement of facts, hence repetition of what is already universally known , the author should not be blamed for that because the events surrounding Tendulkar ,on and off the field, have unfolded before us in the last 25 years or so. In the narrative, there are many instances of mind games played and strategies adopted to outwit the opposition which makes up for very interesting reading. A disappointing aspect in the book, however is that the author has not devoted much space to some of his great contemporaries. No mention is made about Kapil Dev's final appearance in test cricket though Sachin was a member of the team at that time. More surprisingly, some of the gem of innings played by Rahul Dravid hardly gets mentioned.Though Rahul and Sachin partnered in Test maches in 143 innings, and scored 6905 runs as partners with 20 century and 29 half century partnerships,it is surprising that Rahul's achievements and his contribution to Indian cricket has not found any place in the book. In this respect, Brian Lara, Sourav Ganguly and V.V.S.Laxman should consider themselves slightly better off.", "To sum up, much more was expected from Sachin Tendulkar,not only about himself, but also for his insights about those greats who played along with him and against him.", "finished it ....sachin is the best....we saw ....funny ....naughty....normal....emotional....family guy....sachin's journey through his eyes...", ".how he achieved the greatness.....but remain gentle....kind....always on the ground...only his bat talked....countless pains ....sacrifices...sheer hard work......passion....compassion......the man we all loved....lived his dream with our dream.....the tears on his failure...the joy n celebration on every little success ,he had we all had....our world stopped whenever he played....nothing else mattered ....his nervous nineties made us nervous....his 100s made us forget personal failures...a 16 year boy ....Indian conquered the world......we all did....honesty...kindness...politeness.....hard work....optimism...are his virtue...simplicity at its true beauty...an artist... true bharat ratna....world ambassador.....you will always be in our heart....will watch your innings again and again and again....we love u....thank u sachin"]},
{"reviews": ["Playing It My Way: My Autobiography by Sachin Tendulkar, and co-authored by renowned cricket historian and media personality Boria Majumdar is the much-awaited official autobiography of cricket’s batting icon Sachin Tendulkar. Fans of the master-blaster are treated to delightful strokes of not the bat but the pen as the batting legend discussed all aspects of his life that have not been shared previously.", "Beginning with his childhood, the memoir is a journey through the life of Sachin through twenty-eight informative and insightful chapters, from the first time he lifted the bat to his last walk back to the pavilion. It is as much a memoir of Sachin as much as it is a history of cricket in India.", "Sachin’s autobiography covers his family, wife Anjali, his first tour, his captaincy of the Indian cricket team, the period that severely tested his career, about music: his second love, the highs and lows of his prolific career and the glorious World Cup triumph. While Sachin’s life has been an open book, fans will get to know him better through this memoir as he shared many personal thoughts which will surprised many.", "Sachin’s autobiography will also benefit charitable causes as the proceeds from the sale of Playing It My Way: My Autobiography by Sachin Tendulkar with Boria Majumdar will be used to support two charitable causes: the alleviation of malnutrition in children and the provision of clean water to the underprivileged. All the more reasons for fans to buy the book, if not for keepsake alone!", "This is an autibiography that would appeal to the diehard sachin fans. For me personally, it was a nostalgic read , reliving all his matches with some interesting titbits here and there. But for someone who hasn't followed his career so closely or someone who is cricket neutral , an endless grind of all his matches awaits you!", "Great insights into the mind of one of the best batsman of the world. Some of the instances on how he interprets the ball before it is delivered talks volumes about the ability of this individual. Ideal only for people who have followed Indian cricket over years. The last part i.e. his retirement speech still gives goosebumps.", "Great read... If u r an avid cricket fan then u can relate to the tournaments Sachin mentions... If u don't follow cricket closely u will still enjoy learning about the game. We often feel that Sachin is an effortless player but this book shows the immense hardwork he has put in and how consciously Sachin tries to be grounded", "Like every one I also hoped the best from him.But it was not like an autobiography but can tell it as match to match statistics.Because it is really not an autobiography as written by Boria Mazumdar and Sachin has given him interviews.But it is not bad to buy it.Some recalls from Sachin about his life are worth to know....", "I bought the autobiography with a lot of expectations and none were fulfilled - not written interestingly enough and not much insight into what was happening in his mind and in the cricket field. The silence on the match fixing controversy which affected so many of his colleagues is very disappointing. Overall a poor buy", "Its an Awesome Book for Sachin Fans Specially when you take him as your God. And yes for non Sachin fans too its a wonderful book to read some real life fact files of the super human. Does not let you down. And yes if you have Sachin fans who don't buy the book gift them one as i did. Gives greater Joy.", "It's hard to believe the way sachin handled everything at such a big stage for so long.....to predict the next  delivery even before the bowler has started his runup, shows his greatness!!!!!", "Surely the content justifies the title of the book....What", " a man..... Sorry..... \"SUPERMAN\"", "Amazing book with amazing illustrations. Brings back memories of childhood and eager waiting of master blaster to come on pitch. The alacrity with which Sachin has faced so many injuries and still served nation through cricket is totally inspiring. Respect aa hi jata hai bande ke liye... Sab padh ke.", "It's give me to close view about sachin life. it's a really good to know the secrete thing in sachin life.His passion about game as a team player, as a supportive senior , friendship , people expectation and much more.. I love this book. Thanks Sachin for this great gift to your love-once."]},
{"reviews": ["his autobiography contains the content which we all generally know through media barring few photos. Nothing interesting or any more insights into the dressing room chats, controversies and their discussions etc, hence making it an OK read.", "Not what I expected from an autobiography. This seems to be just a chronological summary of Sachin's playing career without any soul in it - it just goes on to say \"this happened, then this happened, then this happened\". I don't mind that he skipped the match fixing and spot fixing controversies, but then there is nothing in terms of how the team was built, what was the team mindset in Australia '02 - '03, or Kolkata '01... there seems to be no feeling in what has been written. To be fair, there are some poignant passages - like WC'99 when Sachin's father died and the Kenya match after that when he go 140*, or when Dravid declared in Multan with him on 194* or his epic 241* in Sydney, but there are few and far in between.", "Compared to something like Agassi's autobiography, this makes for very bland reading. It's just like the man himself, totally non controversial. Maybe my expectations were high but in all fairness, what a cricinfo.com editor like Sid Vaidyanathan or Sid Monga writes about cricket impacts me more than this book did.", "Its is an easy book  to read. More enjoyable by cricket fans who can relive their memories of watching sachin batting. However it does feel underwhelming for those expecting a detailed analysis of state of cricket during the last 25 years.", "Reads like a text. Plain and simple, to the extent of being labelled as boring! Sachin doesn't share his insights about the game, and his thoughts on critical issues like match-fixing. May be he played the game just for its enjoyment, and made a shield wall around himself and avoided all other thoughts.", "excellent. a true portrayal of  Sachin's personal and professional life.", "made a very pleasant reading..simple and lucid presentation.", "on page 7 at the last para, Dreaming of a bicycle, it is \"a\" instead of\" I\".", "Thanks Sachin for a wonderful book and to make or life more beautiful . You are an inspiration to all of us and this book just ignites the spark more strongly . Dear viewers if you read this book it is going to be a lifetime experience", "The story telling is honestly not that great but it's Sachins story so its gotta be worth reading! Its like going to Kashmir and taking a picture, it doesn't matte how (not) skilled the photographer is, it's going to be an amazing one.", "This is a must read.  Started reading it and could not stop before it finished.  An isight to Sachin's life.  Some of the controvorsies were not discussed which leaves viewers wanting for just a bit  more.  All in ll a great reading.", "Expected more intense and less crib from sachin. Disappointed", "Nothing much to say about this book, received ok, but there was no lamination-seal on the book (my colleague got a laminated sealed copy of the book from Amazon), first I thought it is a used one. But overall I am satisfied."]},
{"reviews": ["Loved the book as I got to know a lot about the Wizard of cricket himself, enjoyed reading many anecdotes and life of great Cricket legend. This book is for Sachin lovers and not necessarily book lovers.", "Should have been more informative and should have contained incidents that were not in public domain earlier. Whatever is there are already known to the readers. Disappointing. NAM BARE DARSHAN CHOTE.", "the much anticipated book included more of stats which are better available on cricinfo.", "would have been better if god of cricket would have shared some more incidents  of his cricketing career", "Amazon delivery is good. received before delivery date..", "About Book, As lik many am also a Hardcore fan of sachin I love the book.  Chance to know about his personal feel as a crickter.", "Enjoyed reading the book...cricket, cricket & cricket...very well written....could have been more interesting if other items like dressing room chats, in field banters etc. were also included...", "I expected more from Sachin in his autobiography. Very disappointed since he hasnt shared much on how he thinks, strategizes the game. He has also avoided the match-fixing saga of the late 90s.", "The book provides a wonderful insight into all those little details which would been overshadowed in the scheme of larger things....absolute joy to read and very friendly language used too", "not as expected, I am very disappointed with the book.", "Content and some cricket  moments can keep you busy but the pattern of writing is not as expected, could have been better.", "I cried when he announced 200 will be his last.", "I cried when he entered Wankhede for one last time with Indian cricket jersey.", "I cried whenever I saw his glimpse on TV.", "I cried when he scored his last runs for India.", "I cried when he gave hell of emotional speech.", "He made my childhood days awesome.", "I am proud I watched # cricketto see his bat only.", "Now I am crying as that child has died on this day, last year.", "I will cry again remembering those unforgettable memories.", "A must read for a Sachin fan; No startling revelations; One thing that struck me was the amount of injuries he had to deal with over the course of his career. Hats off to his passion!"]},
{"reviews": ["The journey of the sport's biggest and nation's greatest cricketing hero from his initial days to being a BHARAT RATNA recipient. Needless to say.....AWE-INSPIRING", "No fault with the book or the quality but the packaging needs to be modified I suppose. Despite of having such a hard cover, all the corners are bent inwards.", "Sachin is worth to be praised on field but reading his point of view on Yuvraj in world cup 2011 was complete disappointment. A man with a big \"I\".", "Disappointed... maybe due to unrealistic expectation..most of the things said in the book are common knowledge. No revelations. Just statements and facts.", "Playing it My way is a simple and sweet writing of @SRT, its just like watching his batting without any disturbance. Thank you SRT for this presentation", "One can get lot of inspiration, motivation out of this awesome book. My respectful pranam to this great son of Mother India. ...Sachin Tendulkar.", "Its an average book. Could not met upto my expectations as most of the info looks as if its a copy paste from a news paper or a cricket database.", "Very well written!! The god himself describes his life with full grace!! His passion for the sport is beyond reach of anyone's", "imagination!!", "You get to know out of scene moments of major incidents happened n indian cricket. Also ull know more about sachins personel and childhood life.", "Poorly written bio, disappointing from a man of his caliber. Very few personal insights, more a recollection of scoreboards, injuries and food."]},
{"reviews": ["Amazing!!!!!", "I think every Indian must read it. I am writing this review after completion of 25% of the book. I am reading slowly because I really dont want to finish it.", "The service of the amezon is good but i have not like the case of the product the sticker of the book is getting loose at the first time  when i have broke the sealm of the packege", "Nice book as a fan brought and studied...", "Felt happy not only happy extreme happy...feeling proud of him and proud to be his name from my childhood and wanna continue forever", "I really liked the way it's been written... got to know about Sachin Tendulkar personal side which is unknown and it's really heart-touching to know his struggles and hard work...", "The book contains the fact that most of us already know. Missed the charm most autobiographies have.", "5-stars for Amazon for delivering the product within a single day.", "It was nice to read the book & to know a few issues which were not known . Thanks to Sachin for giving us a few hints, what are", "happening in Cricket in India & in the World.", "WE LOVE YOU SACHIN......EVERY TIME WE TURN ON THE TV TO WATCH A CRICKET MATCH WE ALL WISH THAT ITS YOU WHO IS COMING TO BAT WITH THAT MRF BAT AND ENTERTAIN US ALL......MISS U", "I M DIE HEAD FAN OF SACHIN TENDULKAR'S BATTING", "BOOK IS VERY GOOD FOR SACHINS FANS ITS MASTER STROKE", "GO FOR IT", "SPECIAL REPUBLIC DAY OFFER", "DONT MISS IT", "Its a good book for cricket lovers. You can feel the sentiments going through a player's mind on and off the cricket field. Only flaw is use of too many statistics.", "interesting book. the time of ordering it was showing delivery will be in 4 working days but i got it the next day itself. the packing was very good and safe too..."]},
{"reviews": ["THE BEST BOOK I HAVE EVER READ.", "SACHIN HATS OFF FOR THIS BIOGRAPHY.", "HAD TEARS WHEN READING SOME EMOTIONAL RETIREMENT EVENTS", "Brilliant book. If you are a cricket fan, you will love this book. Sachin has wrote this book from his heart and it contains the inside story of Indian dressing room too. He has touched all controversies. I can write a book while reviewing this book. It is the first english book which I have bought and reading with so much interest. It is a book I will keep throughout my life with me.", "Thank you so much amazon for making the start of this sunday so awesome!!", "Like every cricket crazy Indian, pre ordered it and got it today. Time to revisit childhood. Must buy everyone. For those who do not love cricket.. U must read this... U'll definetly fall for it.", "presented beautifully.", "The expectations of a proud INDIAN is always high from a man of his stature. I expected more from him .", "An uninteresting account of an otherwise exciting career!", "Sachin should have chosen a better writer to pen his autobiography.", "Thank you, Sachin!", "You will rewind your old cricket viewing experience through each page.", "Very prompt delivery by Amazon", "Amazing Book. Great efforts put on by all the persons to make it successful. Easy read and attention grabbing events. Thank You.", "From Amazon perspective, it was delivered on time. The book is worth a read for anybody inIndia who loves cricket and Sachin.", "The book is great. All credit goes to Sachin not to you guys. Your delivery was pathetic. The delivery was delayed by 4 days.", "Honesty Is The Name Of The God Of The Cricket ....... Every Cricketeer Should Must Read It....", "I Recomended For Everyone"]},
{"reviews": ["Superb book, well written by Sachin and Mujumdar. I could really correlate the lifestyle Sachin lived till his teens with every Mumbaikar.", "Its okey, not nail biting and very interesting.i brought for Mr Tendulkar and am a die hard fan of The masterblaster.", "Salute you sir", "GOOD ,but I had expected a signed copy which I did not receive.", "THERE WAS NO HARD COVER EITHER.", "Appreciate the timely delivery.", "Sachin played with his heart and so has he done with the pen in his hand this time. This book is one of the finest work. The words have come out as straight as his drives. Right from the heart of the man with a heart of gold. It is simple yet intriguing. What makes this book stand out is the fact that this comes from the man who has seldom spoken publicly on what goes in his life. A life which every Indian was part of in one way or the other. They wanted to hear what their hero had to say. This book is a salute to anyone and everyone who has been his fan and more for those who have not liked him for whatever reasons. Tendulkar being Tendulkar has once again delivered to the expectation of a billion people.", "\"Generations to come, it may well be, will scarce believe that such a man as this one ever in flesh and blood walked in and off the 22 yard belt for 22 years\"", "For them who could not see this man conduct himself in and off the field and get inspired, this book should serve the purpose.", "The book is below expectations. It is more of a stats book than biography. Espncricinfo articles are far better than this. Disappointed!", "Inspiring book for one and all. Especially, the Engish used is simple and clear and thus making it easy to comprehend by all age groups.", "It's a very good book, which gives an insight look in the life of the world's greatest batsman. The book keeps you engaged till the end.", "A must read for all Sachin (cricketer and person) fans!", "Could have been better by including instances from Sachin's personal life.", "What Can I say about this book.!! The name it self suggests. Quality wise this is good book. I will keep it with me for a memories..!!", "Its entire Life sketched on paper!!", "Really awesome, very Inspiring and teaches how positive approach leads one to success!"]},
{"reviews": ["Its interesting to read master blasters childhood and how he trained to get to top.. its not a life story type but the incidents and experiance", "Excellent book for true sachin's fan because it contains whole story about his life n describe all the matches he played in his 24 year career", "Decent read. Book was silent on sachin's inherent motivation of scoring runs on all terrain...", "Indeed he is \" Bharat Ratna\"", "leaves a tear drop in the eye of every cricket fan! the mammoth size is justified by the 24 year long marvelous career! the work of a genius!", "simple, honest and descriptive. One may find Autobiographies to be boring but grab this edition of the legend and I bet you cant put it down.", "Good read for Sachin Fans. Deliberately seems to have ignored match fixing controversy and his review of bowlers and batsmen during his time.", "Book is awesome like Sachin. I'm still in middle of da book nd enjoying a lot. Thanks to sachin for sharing his story..............brilliant.", "May not be a literary gem, but it's an honest book from the gentleman of the game. Could replace the book of history of cricket, undoubtedly.", "On time delivery.  I am very happy", "The book arrived before time and in great condition. it is a pleasant read!! and a perfect gift for a cricket lover and a sachin die hard!"]},
{"reviews": ["Readable for a cricket lover who has grown along and followed Sachin's career.... Not much of Masala.... There are so many secrets in cricket but he has skirted around them.... A gentleman's book !!! Readable but not HOT !!!", "Awesome book by Sachin sir.", "The perfect story wid every chapter he touched our hearts wid his life story and we know from this that how he became the god of cricket wid dedication and hard work.", "Hats off to u.", "It is just awesome...... This man was under scanner for whole career and still has so much to say..... no controversies.... it's written in a dignified way..... hats off The master...... it's not just a book, it's as precious as geeta/bible/quran for cricket lovers.......:-) :-)", "The book did not live upto the expectations. He has avoided most of the controversies which rocked world cricket during his time.", "The book just focuses on Indian victories and how Sachin played his part in those.", "One of the disappointing innings by Sachin... Not much insight..  I played this tour on this day... We played well/badly.. We won/lost the match... This is how the book goes... Cricinfo's timeline does a better job..", "It was a good read. Being a Sachin fan I never knew he had to battle some injuries or the other throughout his long career. You would get an insight about how  great sportsman live their lives after reading this book", "Must read for any individual. People only see the successful  face and not the effort behind that success. It's not about Tendulkar's success, it's about all people who supported and helped him cultivate his talent.", "Sachin was always my hero and still he is my idol.Whatever he does he always carry some sort of good information for our society.i cud not control my tears when he was delivering his farewell speech .he is an icon.", "Interesting book but very lengthy should have been short", "The book is good. We can read a single time. It shows us how dedicated he is, hardships he has faced as a cricketer.", "He is a true Inspiration to Younger ones who wants to get into the field of Cricket."]},
{"reviews": ["Amazing service by amazon.", "I thoroughly enjoyed the book .", "His way of the play , is an inspiration .", "Absolutely amazing! Don't hesitate, its that man! this book is from his heart! go get a copy! #ThankYouSachin once more! and prompt delivery by amazon! the book was released on 6th and I received it on 8th at around 1 pm.", "Nice quality, immediate delivery, packing a bit uneven, but no damage to the book.....nice experience....Fully satisfied!", "The autobiography of living god, you will real feel great while reading. God has opened every aspect of  his life.... :)", "What do I write about life of God!!!", "So the content is great only..  and so is the book quality and amazon service!", "love it... this is so motivating !!", "More than a cricketer he is one of the best human being alive in this world!!!", "he is silent on so many crucial issues importantly regarding match fixing nd drs. a man of his stature needs to open up", "Fantastic book! Even my wife, not a lover of cricket, fully read it without dropping. Sachin's honesty is exemplary.", "I am impressed with the service. Good. I will keep buy books and other things in Amazon as it meets my expectation.", "Amazing read! And you will feel Sachin , ie his humbleness in the entire book. Masterpiece from the little master!"]},
{"reviews": ["A good stuff with lot of excitement n fun..n also there is many unknown things which really make it worthful buy..", "St wrote superb. .. whenever I started to read it den I will not like to leave the vook until it will be finished", "Fantastic read in terms of what makes the man Sachin Tendulkar a great idol and brans ambassador as a Sportsman.", "The man who cricket loved back.... Amazing, inspirational... Ramayan, Bible, Khurran and Playing It My Way......", "it's a very interesting, nice and great book. It contains many details about Sachin Tendulkar my favorite player", "This Book is a must for all Sachin Fans. It's a collectors item. You can say, this is THE HOLY BOOK of Cricket.", "Book realeased on November 6th and I had it in my hands on 7th November.", "Perfect way to settle my weekend.", "What a brilliant player and now what a philosophy of words painted for him.", "Gr8 experience. I loved it !!", "Book Is Too Good. Even Pages Are Around 500 Still Book Weight Is Less. Pages Quality Also Beyond Expectations.", "Must read for a Sachin fan. I don't think people who don't like following cricket would appreciate this book."]},
{"reviews": ["i did not expect this book to be that great..the content is clean and well organised.....its a very good book", "The book is fine and the price is (was) half , so of course i went for it ....... up to expectations .......", "far better watching him bat than reading his version of Indian cricket. Interesting but not exactly gripping", "The autobiography is something of a disappointment; not at all in keeping with the maestro's fluent batting.", "amazing........love the way sachin included everything in the book from his childhood to till his retirement", "It is the most inspirational book ever.The god of cricket has done a outstanding job and thanks to AMAZON.IN", "wonderful pieces of information and natural narration - I love the king of cricket and also the book on him.", "Sachinnnnn Sachinnnnn... Sachinnnnn Sachinnnnn...", "I almost cried right in the starting while reading about his final test.", "He explained so well about his childhood and the early days with Ramakanth Sir.", "A must read book.", "Was expecting the unexpected.", "....more the normal stuff that we all know that was covered by the media", "great career bad writting"]}]