[u'Let me make it clear that I consider myself the greatest Sachin fan alive. However I shall try to be fair in my review.', u'The first 100 or so pages that described Sachin\'s childhood formed the best part of the book. You would laugh, smile, get astonished and surprised ("Sachin used to do this to?" ...you would think). You will find that Sachin was, in most ways, the same cricket loving kid you were and will be able to relate to many of his mischief,ideas and thoughts.', u"However the fun ends along with those chapters. The rest of the book is a like a commentary of his matches. Almost all the matches have been included. It will refresh your memories of Sachin's batting, and you will relive some of the matches you might have forgotten.", u'However for a Sachin fan who would have certainly followed most of his career and would have all of his matches strong in his memory, this is provides little comfort. You expect more from Sachin than just summary of his matches.', u'Like most of the books on Sachin, this one too misses out on some of his iconic ODI innings. The 200 against SA is just brushed upon in commentary. The 175 VS Australia is not even mentioned. Focus is more on tests and less on ODIs.', u'I bought an edition with some great personal photographs of Sachin.', u'The book also does provide some dressing room gossips that Indian general fan always looks forward to, but in just the subtle amount. Strong views on Chappel, the 194 declaration by Dravid, some of his ideals and some surprising cricketers Sachin respects... all of these provide little  treats to the reader.', u'While some might skim through pages, this book provides some great insight  as to how Sachin used to prepare against some bowlers. How he used to adjust during difficult times. What strategies he used to form. At times I felt, how come Sachin has just hundred 100s, he should be having about 200 centuries. And this might just be the material a teenager, wanting to make a career in cricket might find extremely useful.', u'There is humor in appropriate amount. And almost all varities of statistics possible. Whole scorecards have been included.', u'This would be an ideal book to gift to your son/sibling if he is thinking of a future in cricket as his career.', u'I give it 3.5 stars.', u'Being a vivid Sachin fan I expected more of thought process and behind the screens happenings in the game and in the dressing room. But this book is disappointment on this front. This book is more of various essays about all his innings put together.', u'Even after reading the book you wont get a feeling that you know Sachin more than before reading it.', u"There's nothing in it which we don't know. Rather than describing his hardships and mental make-up for the game, the book just feels like a scorecard and summary of every series he played. If you are not a cricket fan, you should stay away from this and if you are one, then too you will be disappointed with this.", u"The book as such reads like a Journal - mostly a running commentary of matches (although important, key matches) which gets monotonous after a while. That is something, since all the matches mentioned are the milestone matches in Sachin's career and for any fan of Indian cricket, that holds considerable interest.", u"Sachin's relations within his family, especially with his kids, with teammates, and the food he had during his tours, besides personal anecdotes from some of the matches are broadly the highlights of the book. Also,finer points of his playing technique are mentioned here and there, which would be of interest to the keen follower of the game.", u"The part of the book that lets you down is its non-controversial stand on most issues. Match fixing is mentioned only in passing, barely a few pages are dedicated to the Monkeygate scandal. BCCI is held up in high esteem almost everywhere. Most surprisingly, Yuvraj Singh's struggle with cancer and Sachin's stint with the Parliament as a Rajya Sabha member do not find a mention in this book.", u"It is still worth buying and reading, because it is Sachin after all. The pictures generously sprinkled within the book are a collector's delight. What strikes one throughout the book is the straightforward, uncomplicated approach that Sachin seems to have towards his life. That alongwith the devotion towards family, the patriotism and the attention to the minutest details of the sport are the key impressions one could treasure, as we complete this book.", u"When you follow a sports personality and the game passionately for so long, you'd expect the life story to be equally riveting. This books while good and informative falls short of being great. It seems rather superficial and gives you nothing but a bit more than what is already known about the man. It doesn't help that there are pages and pages of statistics which seem to be there for the sole purpose of filling up pages.", u"It would've been nice to have some personal views from the man on things like the match fixing scandal and his views of Azharuddin and Jadeja getting caught in the storm, his relationship with Vinod Kambli or even more anectodes if being on tour. Maybe, like with his batting we come to expect too much from him...", u"In last 20 odd years, I loved reading anything written on Sachin and was hoping for great insight about this man. Honestly, it was bit disappointing except for first few chapters and last few chapters. I felt like some of the contents were rushed through in hurry. Though I'm not dissapointed by Sachin himself, but certainly Author has done poor job in extracting best out of Sachin and articulating in rather insightful way. Perhaps, it would have been good idea to write multiple volumes rather than rushing through all in one shot. No matter what, my admiration for Sachin will be same forever.", u"Even if Sachin scores reasonable runs but fail to reach 100 then most of us feel as if Sachin failed. That's his stature - we always demand the best of him. So it is obvious that we all must be having Everest high expectations from his book as well.", u' Motivation, doubtless dedication, childish fun, a bit of romance, writhing in stress of expectations, bouncing back - this book tells it all. Hands off to the legend for giving very minute details of life even if sometime it is embarrassing and sometime controversial.', u' But for some reasons to a great section of book lover it is not going to be a great book. Just like 90+ out score this book does not reciprocate to the highest level of expectations.', u'My analysis goes like:', u'-> For those who aim to play for state/country this book is a MUST read.', u'-> For many cricket lovers who are not interested in technicality of the game  - a few chapters MUST be SKIPPED', u'-> For those who have no extra warmth for cricket - only a few chapters can be read', u'Finished reading the book " Playing It My Way" an autobiography of Sachin Tendulkar. For those in search of any sensational revelations in the book, it is a a disappointment. Nobody expects from a person who has steered clear of any controversy during his playing days, to create any sort of controversy at this stage. Though a major portion of the book just appears as statement of facts, hence repetition of what is already universally known , the author should not be blamed for that because the events surrounding Tendulkar ,on and off the field, have unfolded before us in the last 25 years or so. In the narrative, there are many instances of mind games played and strategies adopted to outwit the opposition which makes up for very interesting reading. A disappointing aspect in the book, however is that the author has not devoted much space to some of his great contemporaries. No mention is made about Kapil Dev\'s final appearance in test cricket though Sachin was a member of the team at that time. More surprisingly, some of the gem of innings played by Rahul Dravid hardly gets mentioned.Though Rahul and Sachin partnered in Test maches in 143 innings, and scored 6905 runs as partners with 20 century and 29 half century partnerships,it is surprising that Rahul\'s achievements and his contribution to Indian cricket has not found any place in the book. In this respect, Brian Lara, Sourav Ganguly and V.V.S.Laxman should consider themselves slightly better off.', u'To sum up, much more was expected from Sachin Tendulkar,not only about himself, but also for his insights about those greats who played along with him and against him.', u"finished it ....sachin is the best....we saw ....funny ....naughty....normal....emotional....family guy....sachin's journey through his eyes...", u'.how he achieved the greatness.....but remain gentle....kind....always on the ground...only his bat talked....countless pains ....sacrifices...sheer hard work......passion....compassion......the man we all loved....lived his dream with our dream.....the tears on his failure...the joy n celebration on every little success ,he had we all had....our world stopped whenever he played....nothing else mattered ....his nervous nineties made us nervous....his 100s made us forget personal failures...a 16 year boy ....Indian conquered the world......we all did....honesty...kindness...politeness.....hard work....optimism...are his virtue...simplicity at its true beauty...an artist... true bharat ratna....world ambassador.....you will always be in our heart....will watch your innings again and again and again....we love u....thank u sachin', u'I go through the book, we respect the achivement of sachin tendulkar, but not his book, its not containing what we expected. it is like a redaing of his match innings,  90% of episode we knowing earlier. only good thing is i got the copy with lower price by amazon.in', u'thanking you', u'with regards', u'somashekar padukare', u'bangalore']